Velocet/iown-homecontrol/scripts/SVD/ATmega128P-iown.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>Analog-to-Digital Converter</description>
      <baseAddress>0x00000078</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x6</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADC</name>
          <description>ADC Data Register Bytes</description>
          <addressOffset>0x0</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADC</name>
              <description>ADC Data bits</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSRA</name>
          <description>The ADC Control and Status register A</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADPS</name>
              <description>ADC Prescaler Select Bits</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>ADPS</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>PRESCALER_2</name>
                  <description>Prescaler Value 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_2</name>
                  <description>Prescaler Value 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_4</name>
                  <description>Prescaler Value 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_8</name>
                  <description>Prescaler Value 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_16</name>
                  <description>Prescaler Value 16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_32</name>
                  <description>Prescaler Value 32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_64</name>
                  <description>Prescaler Value 64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_128</name>
                  <description>Prescaler Value 128</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADIE</name>
              <description>ADC Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADIF</name>
              <description>ADC Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADATE</name>
              <description>ADC Auto Trigger Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADSC</name>
              <description>ADC Start Conversion</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADEN</name>
              <description>ADC Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSRB</name>
          <description>The ADC Control and Status register B</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADTS</name>
              <description>ADC Auto Trigger Source bits</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>Free Running mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>Analog Comparator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>External Interrupt Request 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Timer/Counter0 Compare Match A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x04</name>
                  <description>Timer/Counter0 Overflow</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x05</name>
                  <description>Timer/Counter1 Compare Match B</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x06</name>
                  <description>Timer/Counter1 Overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x07</name>
                  <description>Timer/Counter1 Capture Event</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACME</name>
              <description>No Description.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMUX</name>
          <description>The ADC multiplexer Selection Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUX</name>
              <description>Analog Channel and Gain Selection Bits</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>ADC Single Ended Input pin 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC1</name>
                  <description>ADC Single Ended Input pin 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC2</name>
                  <description>ADC Single Ended Input pin 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC3</name>
                  <description>ADC Single Ended Input pin 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC4</name>
                  <description>ADC Single Ended Input pin 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC5</name>
                  <description>ADC Single Ended Input pin 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC6</name>
                  <description>ADC Single Ended Input pin 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC7</name>
                  <description>ADC Single Ended Input pin 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_ADC0_10X</name>
                  <description>ADC Differential Inputs Postive pin 0 Negative pin 0 10x Gain</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC1_ADC0_10X</name>
                  <description>ADC Differential Inputs Postive pin 1 Negative pin 0 10x Gain</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_ADC0_200x</name>
                  <description>ADC Differential Inputs Postive pin 0 Negative pin 0 200x Gain</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC1_ADC0_200X</name>
                  <description>ADC Differential Inputs Postive pin 1 Negative pin 0 200x Gain</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC2_ADC2_10X</name>
                  <description>ADC Differential Inputs Postive pin 2 Negative pin 2 10x Gain</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC3_ADC2_10X</name>
                  <description>ADC Differential Inputs Postive pin 3 Negative pin 2 10x Gain</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC2_ADC2_200X</name>
                  <description>ADC Differential Inputs Postive pin 2 Negative pin 2 200x Gain</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC3_ADC2_200X</name>
                  <description>ADC Differential Inputs Postive pin 3 Negative pin 2 200x Gain</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 0 Negative pin 1 1x Gain</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC1_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 1 Negative pin 1 1x Gain</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC2_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 2 Negative pin 1 1x Gain</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC3_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 3 Negative pin 1 1x Gain</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC4_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 4 Negative pin 1 1x Gain</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC5_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 5 Negative pin 1 1x Gain</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC6_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 6 Negative pin 1 1x Gain</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC7_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 7 Negative pin 1 1x Gain</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_ADC2_1X</name>
                  <description>ADC Differential Inputs Postive pin 0 Negative pin 2 1x Gain</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC1_ADC2_1X</name>
                  <description>ADC Differential Inputs Postive pin 1 Negative pin 2 1x Gain</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC2_ADC2_1X</name>
                  <description>ADC Differential Inputs Postive pin 2 Negative pin 2 1x Gain</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC3_ADC2_1X</name>
                  <description>ADC Differential Inputs Postive pin 3 Negative pin 2 1x Gain</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC4_ADC2_1X</name>
                  <description>ADC Differential Inputs Postive pin 4 Negative pin 2 1x Gain</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC5_ADC2_1X</name>
                  <description>ADC Differential Inputs Postive pin 5 Negative pin 2 1x Gain</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_VBG</name>
                  <description>Internal Reference (VBG)</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_GND</name>
                  <description>0V (GND)</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADLAR</name>
              <description>Left Adjust Result</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REFS</name>
              <description>Reference Selection Bits</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>REFS</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>AREF</name>
                  <description>Aref Internal Vref turned off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVCC</name>
                  <description>AVcc with external capacitor at AREF pin</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IVcc1</name>
                  <description>Internal 1.1V Voltage Reference with external capacitor at AREF pin</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IVcc2</name>
                  <description>Internal 2.56V Voltage Reference with external capacitor at AREF pin</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIDR0</name>
          <description>Digital Input Disable Register</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADC0D</name>
              <description>No Description.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1D</name>
              <description>No Description.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2D</name>
              <description>No Description.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC3D</name>
              <description>No Description.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC4D</name>
              <description>No Description.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC5D</name>
              <description>No Description.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC6D</name>
              <description>No Description.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC7D</name>
              <description>No Description.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
