Velocet/iown-homecontrol/scripts/SVD/ATmega128P-iown.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI</name>
      <description>Serial Peripheral Interface</description>
      <baseAddress>0x0000004C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SPCR</name>
          <description>SPI Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPR</name>
              <description>SPI Clock Rate Selects</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>SPR</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>FOSC_4_2</name>
                  <description>Fosc/4 if SPI2X == 0 else Fosc/2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOSC_16_8</name>
                  <description>Fosc/16 if SPI2X == 0 else Fosc/8</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOSC_64_32</name>
                  <description>Fosc/64 if SPI2X == 0 else Fosc/32</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOSC_128_64</name>
                  <description>Fosc/128 if SPI2X == 0 else Fosc/64</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>Clock Phase</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPOL</name>
              <description>Clock polarity</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MSTR</name>
              <description>Master/Slave Select</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DORD</name>
              <description>Data Order</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPE</name>
              <description>SPI Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIE</name>
              <description>SPI Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDR</name>
          <description>SPI Data Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPD</name>
              <description>SPI Data bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SPSR</name>
          <description>SPI Status Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPI2X</name>
              <description>Double SPI Speed Bit</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WCOL</name>
              <description>Write Collision Flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SPIF</name>
              <description>SPI Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TC0</name>
      <description>Timer/Counter, 8-bit</description>
      <baseAddress>0x00000035</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x39</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GTCCR</name>
          <description>General Timer/Counter Control Register</description>
          <addressOffset>0xE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSRSYNC</name>
              <description>Prescaler Reset Timer/Counter1 and Timer/Counter0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM</name>
              <description>Timer/Counter Synchronization Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR0A</name>
          <description>Timer/Counter0 Output Compare Register A</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR0A</name>
              <description>Timer/Counter0 Output Compare A bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR0B</name>
          <description>Timer/Counter0 Output Compare Register B</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR0B</name>
              <description>Timer/Counter0 Output Compare B bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR0A</name>
          <description>Timer/Counter Control Register A</description>
          <addressOffset>0xF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WGM0</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>WGM0</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NORMAL_TOP</name>
                  <description>Normal, Top: `0xff`, Update: *Immediate*, Flag: *MAX*</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE</name>
                  <description>Phase Correct PWM, Top: `0xff`, Update: *TOP*, Flag: *BOTTOM*</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTC</name>
                  <description>CTC, Top: *OCRA*, Update: *Immediate*, Flag: *MAX*</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_FAST</name>
                  <description>Fast PWM, Top: `0xff`, Update: *TOP*, Flag: *MAX*</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COM0B</name>
              <description>Compare Output B Mode, Fast PWm</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>COM0B</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>DISCONNECTED</name>
                  <description>Normal port operation, OCix disconnected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MATCH_TOGGLE</name>
                  <description>Toggle OCix on Compare Match (Might depend on WGM)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MATCH_CLEAR</name>
                  <description>Clear OCix on Compare Match (If PWM is enabled, OCix is set at TOP)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MATCH_SET</name>
                  <description>Set OCix on Compare Match (If PWM is enabled, OCix is cleared at TOP)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COM0A</name>
              <description>Compare Output A Mode, Phase Correct PWM Mode</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues derivedFrom="COM0B" />
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR0B</name>
          <description>Timer/Counter Control Register B</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CS0</name>
              <description>Clock Select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <name>CS0</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NO_CLOCK</name>
                  <description>No clock source (Timer/Counter stopped)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIRECT</name>
                  <description>Running, No Prescaling</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_8</name>
                  <description>Running, CLK/8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_64</name>
                  <description>Running, CLK/64</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_256</name>
                  <description>Running, CLK/256</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALE_1024</name>
                  <description>Running, CLK/1024</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_FALLING</name>
                  <description>Running, ExtClk Tx Falling Edge</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_RISING</name>
                  <description>Running, ExtClk Tx Rising Edge</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WGM02</name>
              <description>Waveform Generation Mode High Bit (Enable Top: *OCRA* for `PWM` modes)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FOC0B</name>
              <description>Force Output Compare B</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>FOC0A</name>
              <description>Force Output Compare A</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT0</name>
          <description>Timer/Counter0</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCNT0</name>
              <description>Timer/Counter0 bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIFR0</name>
          <description>Timer/Counter0 Interrupt Flag register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOV0</name>
              <description>Timer/Counter0 Overflow Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF0A</name>
              <description>Timer/Counter0 Output Compare Flag 0A</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF0B</name>
              <description>Timer/Counter0 Output Compare Flag 0B</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK0</name>
          <description>Timer/Counter0 Interrupt Mask Register</description>
          <addressOffset>0x39</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOIE0</name>
              <description>Timer/Counter0 Overflow Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE0A</name>
              <description>Timer/Counter0 Output Compare Match A Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE0B</name>
              <description>Timer/Counter0 Output Compare Match B Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
