Velocet/iown-homecontrol/scripts/SVD/ATmega128P-iown.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Watchdog Timer</description>
      <baseAddress>0x00000060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WDTCSR</name>
          <description>Watchdog Timer Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WDE</name>
              <description>Watch Dog Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDCE</name>
              <description>Watchdog Change Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDIE</name>
              <description>Watchdog Timeout Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDIF</name>
              <description>Watchdog Timeout Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDPL</name>
              <description>Watchdog Timer Prescaler - Low Bits</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>WDPL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>CYCLES_2K_512K</name>
                  <description>- 2048 cycles, ~16ms/512K (524288) cycles, ~4s if WDPH is set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES_4K_1024K</name>
                  <description>- 4096 cycles, ~32ms/1024K (1048576) cycles, ~8s if WDPH is set</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES_8K</name>
                  <description>- 8192 cycles, ~64ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES_16K</name>
                  <description>- 16K (16384) cycles, ~0.125s</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES_32K</name>
                  <description>- 32K (32768) cycles, ~0.25s</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES_64K</name>
                  <description>- 64K (65536) cycles, ~0.5s</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES_128K</name>
                  <description>- 128K (131072) cycles, ~1s</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES_256K</name>
                  <description>- 256K (262144) cycles, ~2s</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDPH</name>
              <description>Watchdog Timer Prescaler - High Bit</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
